package com.damein;

public enum ReturnCode {

    ERROR_01(-1, "系统异常，请联系管理员"),
    SUCCESS(0, "操作成功"),
    UN_SUCCESS(1, "操作失败"),
    CODE_200000(200000,"操作成功"),

    //----------- 1xxx ---------
    //HTTP以及系统异常
    ERROR_1001(1001, "该请求方式未提供"),
    ERROR_1002(1002, "参数格式不正确"),
    ERROR_1003(1003, "参数校验不通过"),
    ERROR_1004(1004, "参数转换异常"),
    ERROR_1005(1005, "网络异常"),
    ERROR_1006(1006, "用户未登陆"),
    ERROR_1007(1007, "缺少正确的参数"),
    ERROR_1008(1008, "指标区间段表加载失败"),
    ERROR_1009(1009, "用户不存在"),
    ERROR_1010(1010, "用户未绑定分机号"),

    //--------- 2xxx -----------
    //业务异常
    ERROR_61001(61001, "上传文件校验异常"),
    ERROR_61002(61002, "上传文件校验异常,json格式信息"),
    ERROR_61003(61003, "上传文件进件号有重复"),
    ERROR_61004(61004, "可用线路数不足"),
    ERROR_61005(61005, "数据不存在"),
    ERROR_61006(61006, "请联系管理员,不存在话术模板"),
    ERROR_61007(61007, "结束时间早于开始时间"),
    ERROR_61008(61008, "分案未完成无法下载"),
    ERROR_61009(61009, "已绑定智能外呼策略，请先解除绑定关系再进行删除"),


    //用户管理异常
    //--------- 21xx -----------
    ERROR_2101(2101, "用户管理异常"),
    ERROR_2102(2102, "会话已过期，请重新登录"),

    //话术模板异常
    //--------- 22xx -----------
    ERROR_2201(2201, "该模板已存在"),
    ERROR_2202(2202, "更改模板校验出错"),
    //智能呼叫策略异常23xx
    ERROR_23001(23001,"该策略名称已经存在，请重新输入"),
    ERROR_23002(23002,"存在正在呼叫中的批次，不允许编辑"),
    ERROR_23003(23003,"策略名称超过18个字符"),
    ERROR_23004(23004,"话术策略名称不可为空"),
    ERROR_23005(23005,  "批次正在处理，请稍后操作!"),

    //---------- 3，outer服务异常 ----------
    ERROR_3001(3001, "调用呼叫数据插入接口，http请求异常"),
    ERROR_3002(3002, "sign签名校验失败"),
    ERROR_3003(3003, "调用查询任务结果接口，http请求异常"),
    ERROR_3004(3004, "IOException异常"),
    ERROR_3005(3005, "调用提醒短信发送接口，http请求异常"),
    ERROR_3006(3006, "调用短信结果获取接口，http请求异常"),
    ERROR_3007(3007, "文件不存在"),
    ERROR_3008(3008, "工总行邮件请求异常"),
    //---------- 4，规则匹配结果 ----------
    //呼叫规则（ 41XX ）,
    CALL_RULE_4101(4101, "首催呼叫次数未达到上限"),
    CALL_RULE_4102(4102, "催呼叫次数已达到上限"),
    CALL_RULE_4103(4103, "再催收呼叫次数未达到上限"),
    CALL_RULE_4104(4104, "再催收呼叫次数已达到上限"),
    CALL_RULE_4105(4105, "最后通牒次数未达到上限，继续任务"),
    CALL_RULE_4106(4106, "最后通牒次数已达到上限，结束任务"),
    CALL_RULE_4107(4107, "对账催收最长等待时间未达到上限，继续任务"),
    CALL_RULE_4108(4108, "对账催收最长等待时间已达到上限，结束任务"),
    CALL_RULE_4109(4109, "对账催收最长等待时间未达到上限，继续任务"),
    CALL_RULE_4110(4110, "对账催收最长等待时间已达到上限，结束任务"),
    CALL_RULE_4111(4111, "所传规则类型有误"),

    CASE_GREDE_4201(4201, "计算客群综合评分发生异常"),
    //未命中规则
    MISSING_RULE(4000, "未命中任何规则"),

    //---------------5.客群设置------------------
    CUSTOMER_SET_5001(5001, "未设置客群指标"),
    CUSTOMER_SET_5002(5002, "客群编号redis缓存异常"),
    CUSTOMER_SET_5003(5003, "客群中存在重复设置"),
    CUSTOMER_SET_5004(5004, "客群设置名字重复"),
    CUSTOMER_SET_5005(5005, "客群名称已存在"),

    //---------------6.远程调用-------------------
    ERROR_61061(61061, "下载录音异常"),
    ERROR_61062(61062, "下载录音异常编码"),
    ERROR_61063(61063, "远程数据获取失败，请稍后再试"),

    //---------- 7.API接口管理 ----------
    ERROR_7001(7001, "当前授权状态不可进行此操作"),
    ERROR_7002(7002, "账号不存在"),
    ERROR_7003(7003, "账号被禁用"),
    ERROR_7004(7004, "账号不在有效期内"),
    ERROR_7005(7005, "ip未绑定"),
    ERROR_7006(7006, "接口未授权"),
    ERROR_7007(7007, "接口当前授权状态不可用"),
    ERROR_7008(7008, "接口不在有效期内"),
    ERROR_7009(7009, "请求不在有效期内"),
    ERROR_7010(7010, "请求不能重复提交"),
    ERROR_7011(7011, "接口Sign签名校验失败"),
    //-----------------------2018/11/22----------------------
    ERROR_7012(7012, "当前账户找不到对应得网关或线路信息"),
    ERROR_7013(7013, "当前账户找不到对应得网关"),
    ERROR_7014(7014, "当前账户找不到对应得线路"),
    ERROR_7015(7015, "当前账户线路数小于0"),
    ERROR_7016(7016, "每次不能超过500个手机号"),
    ERROR_7017(7017, "手机号格式不正确"),
    ERROR_7018(7018, "至少有一个手机号"),
    //-----------------------2019/3/26----------------------,
    ERROR_7019(7019, "规则名称已存在"),
    ERROR_7020(7020, "ASE秘钥不正确"),

    //-----------------------8 分案规则---------------------------
    ERROR_8001(8001,"无权限操作该分案规则"),
    ERROR_8002(8002,"规则名称重复"),
    ERROR_8003(8003,"本人还款意愿范围不能重复"),
    ERROR_8004(8004,"联系人还款意愿范围不能重复"),
    ERROR_8005(8005,"未找到数据"),
    ERROR_8006(8006,"时间格式有误"),

    ERROR_8101(8101,"外呼时间不能为空"),
    ERROR_8102(8102,"时间格式有误"),
//    ERROR_8103(8103,"还款意愿时间格式有误"),
    ERROR_8104(8104,"还款意愿范围有误"),
    ERROR_8105(8105,"还款状态传0"),
    ERROR_8106(8106,"委案金额状态传0或1"),
    ERROR_8107(8107,"委案金额最多设置4个节点"),
    ERROR_8108(8108,"委案金额必须大于0，且不能重复"),
    ERROR_8109(8109,"委案金额规则启用金额为必填"),
    ERROR_8111(8111,"修改规则时必须传规则id"),
    ERROR_8112(8112,"最多可选4个还款意愿范围"),
    ERROR_8113(8113,"分案规则%s有进行中的分案任务，不能删除"),
    ERROR_8114(8114,"还款意愿规则参数有误"),
    ERROR_8115(8115,"联系人规则中本人外呼结果传参有误"),
    ERROR_8116(8116,"自定义时间设置不能超过30天"),
    ERROR_8117(8117,"通话时长状态传0或1"),
    ERROR_8118(8118,"通话时长最多设置4个节点"),
    ERROR_8119(8119,"通话时长必须大于0，且不能重复"),
    ERROR_8120(8120,"通话时长规则时长为必填"),
    ;
    
    private int code;
    private String msg;

    ReturnCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public int getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

    public String getKey() {
        return this.name();
    }
}
